### Filtering Pandas Dataframe
1. by using ***logical operators***, we can use the < or > to filter out particular results we interested in.
2. by using ***multiple logical operators*** and connecting them using & or |.
3. by using ***isin***
4. by using **str*** accessor (This have multiple functions and methods for filtering data in a flexible way), can be used to know the start and also to know what columns contain what
5. by using ***query***
    ```python
        df.query ('variable'='argument'and 'variable'='argument')
        
    ```
6. ****Nlargest or Nsmallest***, this is useful for the selection of rows the highest or lowest value in a column, respectively
    ``` python
    df.nlargest(size_of_output, column_of_interest)
    df.nsmallest(size_of_output, column_of_interest)
    ```
7. using ***Tilde(~)*** this is used for 'not' logic in filtering
    ```python
        df[~df_name.column_name=='argument']
    ```

8. using the ***loc and iloc*** this is used to select rows and columns based on index or label
    - loc: select rows or columns using labels
    - iloc: select rows or columns using indices
    They can only select a particular dataframe without specifying a condition.
    ```python
        df.loc['label1', 'label2']
        df.iloc[3:5, :]
    ```
    after the column symbol signifies label or column argument selection

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [14]:
df = pd.DataFrame({'name':['olamide', 'james', 'mallory', 'dennis', 'kennedy', 'paul', 'isaac', 'emmanuel'], 
                  'ctg': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'A'],
                   'val': np.random.random(8).round(2),
                   'val2': np.random.randint(1,10,size =8)
                   
                  })

In [15]:
df

       name ctg   val  val2
0   olamide   A  0.46     3
1     james   B  0.53     1
2   mallory   C  0.15     2
3    dennis   A  0.71     2
4   kennedy   B  0.57     1
5      paul   C  0.46     4
6     isaac   A  0.83     4
7  emmanuel   A  0.69     3

In [16]:
df [df.val>0.5]

       name ctg   val  val2
1     james   B  0.53     1
3    dennis   A  0.71     2
4   kennedy   B  0.57     1
6     isaac   A  0.83     4
7  emmanuel   A  0.69     3

In [17]:
df [(df.val<0.8) & (df.val2>2)]

       name ctg   val  val2
0   olamide   A  0.46     3
5      paul   C  0.46     4
7  emmanuel   A  0.69     3

In [18]:
df [(df.val<0.8) & (df.val2==4)]

   name ctg   val  val2
5  paul   C  0.46     4

In [19]:
names = ['olamide', 'paul', 'emmanuel']

In [20]:
df[df.name.isin(names)]

       name ctg   val  val2
0   olamide   A  0.46     3
5      paul   C  0.46     4
7  emmanuel   A  0.69     3

In [23]:
df[df.name.str.startswith('e')]

       name ctg   val  val2
7  emmanuel   A  0.69     3

In [26]:
df[df.name.str.contains('l')]

       name ctg   val  val2
0   olamide   A  0.46     3
2   mallory   C  0.15     2
5      paul   C  0.46     4
7  emmanuel   A  0.69     3

In [30]:
df.query ('ctg == "A" and val > 0.20')

       name ctg   val  val2
0   olamide   A  0.46     3
3    dennis   A  0.71     2
6     isaac   A  0.83     4
7  emmanuel   A  0.69     3

In [35]:
df.nlargest(3, 'val')

       name ctg   val  val2
6     isaac   A  0.83     4
3    dennis   A  0.71     2
7  emmanuel   A  0.69     3

In [34]:
df.nsmallest(1, 'val2')

    name ctg   val  val2
1  james   B  0.53     1

In [36]:
df[~df.name.str.startswith('j')]

       name ctg   val  val2
0   olamide   A  0.46     3
2   mallory   C  0.15     2
3    dennis   A  0.71     2
4   kennedy   B  0.57     1
5      paul   C  0.46     4
6     isaac   A  0.83     4
7  emmanuel   A  0.69     3

In [37]:
df.iloc[0:5, :]

      name ctg   val  val2
0  olamide   A  0.46     3
1    james   B  0.53     1
2  mallory   C  0.15     2
3   dennis   A  0.71     2
4  kennedy   B  0.57     1

### How to Use Loc in Pandas
when using loc we specify the rows and columns we want.
```python
    dataframe.loc[specified rows: specified columns]
```
it can be used in conjuction with slices (:).
```python
    startlabel:stoplabel
```
we can also use an array of boolean values, to return true or false results and the best way is using a **condtional** which creates an alignable boolean series.
- callable functions: this involves the use of the lambda function (the lambda function is an anonymous function that runs on a single expression with multiple arguments).

In [39]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [42]:
ufo.shape

(18241, 5)

In [44]:
uf0.iloc[4,: ]

City               New York Worlds Fair
Colors Reported                     NaN
Shape Reported                    LIGHT
State                                NY
Time                    4/18/1933 19:00
Name: 4, dtype: object

In [46]:
ufo.loc[1:20, 'City':'Shape Reported']

                    City Colors Reported Shape Reported
1            Willingboro             NaN          OTHER
2                Holyoke             NaN           OVAL
3                Abilene             NaN           DISK
4   New York Worlds Fair             NaN          LIGHT
5            Valley City             NaN           DISK
6            Crater Lake             NaN         CIRCLE
7                   Alma             NaN           DISK
8                Eklutna             NaN          CIGAR
9                Hubbard             NaN       CYLINDER
10               Fontana             NaN          LIGHT
11              Waterloo             NaN       FIREBALL
12                Belton             RED         SPHERE
13                Keokuk             NaN           OVAL
14             Ludington             NaN           DISK
15           Forest Home             NaN         CIRCLE
16           Los Angeles             NaN            NaN
17             Hapeville             NaN            NaN
18                Oneida             NaN      RECTANGLE
19            Bering Sea             RED          OTHER
20              Nebraska             NaN           DISK

In [49]:
ufo.City=='Keokuk'

0        False
1        False
2        False
3        False
4        False
         ...
18236    False
18237    False
18238    False
18239    False
18240    False
Name: City, Length: 18241, dtype: bool

In [51]:
ufo.loc[ufo.City=='Nebraska', :]

         City Colors Reported Shape Reported State            Time
20   Nebraska             NaN           DISK    NE  6/1/1943 15:00
222  Nebraska             NaN            NaN    NE   1/1/1953 0:00

In [52]:
ufo.loc[lambda df:ufo.City=='Abilene', :]

          City Colors Reported Shape Reported State              Time
3      Abilene             NaN           DISK    KS    6/1/1931 13:00
6654   Abilene             NaN       TRIANGLE    TX     9/1/1991 1:00
8357   Abilene             NaN         SPHERE    TX    7/15/1995 0:00
8783   Abilene             NaN            NaN    KS  10/14/1995 23:20
10883  Abilene             NaN            NaN    TX  10/19/1997 20:45